{
  "layers": {
    "0": {
      "": {
        "image": "dolphin.png",
        "text": "Year +0\n\nRising seas and loss of reliable fishing sources are threatening a small coastal town. Some locals want a study to explore restoring natural habitats, others demand strong barriers to protect homes immediately, and a few suggest placing more sand on the beach to push back the shoreline and attract visitors.\n\nThe local council has asked you, a coastal engineer, to survey the coastline and recommend actions that could secure the town's future. The community hopes to prevent relocation within the next 10 years if possible.\n\nYou only have limited funds, click or tap on an option below to decide on the course of action you want to take.",
        "options": [
          {
            "desc": "Survey local habitats and plan ecosystem protection as a natural defence.",
            "target": "a",
            "outcome": "Year +0 → +2\n\nYour surveys reveal damage to seagrass meadows, mangroves, and coral reefs. Protecting these ecosystems could allow natural recovery and strengthen coastal defences, though progress will take time. The community must now decide whether to rely on protection alone or add artificial structures for faster results."
          },
          {
            "desc": "Consider building a seawall to defend the town from rising seas and erosion.",
            "target": "b",
            "outcome": "Year +0 → +2\n\nThe council agrees to explore a seawall. While it can protect homes quickly, it may block sand movement, risking erosion that could damage turtle nesting beaches and seagrass meadows nearby. A decision is needed soon."
          },
          {
            "desc": "Transport sand to the eroded beach to widen the shoreline and support tourism.",
            "target": "c",
            "outcome": "Year +0 → +2\n\nBringing in sand widens the beach and increases visitor numbers, but storms quickly wash it away. Without ongoing projects, this approach is expensive and leaves ecosystems under stress."
          }
        ]
      }
    },
    "1": {
     "a": {
        "image": "house.png",
        "text": "To strengthen the shoreline, the town must choose between relying on natural protection or adding built structures.",
        "options": [
          {
            "desc": "Protect seagrass, mangroves, and dunes to allow natural recovery.",
            "target": "a",
            "outcome": "Year +2 → +4\n\nProtection reduces further damage and gives ecosystems space to recover. Seagrass helps stabilise sediment and improve water clarity, while mangroves and dunes absorb most of the wave energy. Progress is slow but steady, and by Year 10 the town may avoid relocation if ecosystems continue to strengthen."
          },
          {
            "desc": "Construct an artificial reef to reduce wave energy and create new environments for fish.",
            "target": "b",
            "outcome": "Year +2 → +4\n\nArtificial reef modules are deployed and begin to shelter parts of the coastline. They attract fish and improve local diving spots, but surveys confirm they do not rebuild lost fish stocks. In strong storms, some modules shift or provide less protection than expected, and maintenance adds to costs. By Year 10 the town is safer in normal conditions, but ecosystems gain less than with full natural protection."
          }
        ]
      },
      "b": {
        "image": "seawall.png",
        "text": "The seawall could protect homes quickly, but it will change the way sand moves and harm nearby ecosystems.",
        "options": [
          {
            "desc": "Reconsider the seawall and move toward nature-based resilience instead.",
            "target": "a",
            "outcome": "Year +2 → +4\n\nConcerns about erosion and habitat damage are raised. Shifting to a mix of mangroves, dunes, and seagrass offers a slower but healthier way to protect the town over time."
          },
          {
            "desc": "Proceed with the seawall and prepare to manage sand movement later.",
            "target": "b",
            "outcome": "Year +2 → +4\n\nThe wall is built and homes are protected. By Year 10 the town is likely still safe, but costs rise as sand must be moved around the wall and ecosystems continue to decline."
          }
        ]
      },
      "c": {
        "image": "hotel.png",
        "text": "Tourism is seen as the quickest way to bring money into the town.",
        "options": [
          {
            "desc": "Invest in eco-tourism by protecting reefs, turtle nesting areas, and seagrass.",
            "target": "a",
            "outcome": "Year +2 → +4\n\nEco-tourism grows and brings new income. Some habitats recover, but heatwaves damage corals. The town can still be protected later with other measures, but ecosystems are stressed."
          },
          {
            "desc": "Keep adding sand to widen beaches and attract tourists.",
            "target": "b",
            "outcome": "Year +2 → +4\n\nWider beaches create a tourism boom, but storms remove the sand again. This approach can keep the town safe if money continues to flow, but it is not sustainable in the long term and ecosystems suffer."
          }
        ]
      }
    },
    "2": {
      "aa": {
        "image": "seagrass.png",
        "text": "Ecosystems are recovering slowly. The town can either reinforce protection, invest in active restoration, or wait for nature to take its course.",
        "options": [
          {
            "desc": "Add cheaper protective measures and partial dune restoration (moorings, boat speed limits, dune fencing and planting).",
            "target": "a",
            "outcome": "Year +4 → +6\n\nThese measures reduce new damage and stabilise habitats. Dune restoration helps trap sand and reduce erosion, while seagrass and mangroves slowly expand. By Year 10 the town is mostly safe, but some of the most vulnerable shoreline homes still need to be relocated in a partial retreat. Ecosystems continue to improve and resilience extends 12–16 more years with moderate costs."
          },
          {
            "desc": "Invest in full-scale restoration (seagrass transplants, mangrove seedlings, dune revegetation).",
            "target": "b",
            "outcome": "Year +4 → +6\n\nRestoration projects are launched, but they are expensive and not 100% effective. Some seagrass transplants establish while others fail, mangrove seedlings are lost to storms, and dune plantings need ongoing care. By Year 10 the town is safe, but uneven results and high costs mean some vulnerable homes still face relocation, and budgets are strained."
          },
          {
            "desc": "Rely on natural recovery without new interventions.",
            "target": "c",
            "outcome": "Year +4 → +6\n\nHabitats spread slowly and water clarity improves in places, but storms cause setbacks. By Year 10 the town can only remain safe with added engineering, and several vulnerable homes must be relocated."
          }
        ]
      },
      "ab": {
        "image": "art_reef.png",
        "text": "The artificial reef creates new structures for marine life and provides some protection, but storms still threaten the shoreline. Reefs alone cannot save the town — more action is needed.",
        "options": [
          {
            "desc": "Add seagrass restoration and expand mangrove and dune planting alongside the reef.",
            "target": "a",
            "outcome": "Year +4 → +6\n\nBy combining reefs with seagrass meadows, mangroves, and dunes, the coast gains stronger natural buffers. Seagrass improves water clarity and stabilises sediments, while mangroves and dunes absorb wave energy. By Year 10 the town is safe, ecosystems are healthier, and long-term costs are more stable."
          },
          {
            "desc": "Create a protected area around the reef and increase protection for nearby seagrass.",
            "target": "b",
            "outcome": "Year +4 → +6\n\nThe reef and seagrass beds show signs of recovery, with fish returning and clearer water improving coastal health. However, protection rules are costly to enforce, and storms still threaten the shoreline. By Year 10 the town can remain safe if dunes and mangroves are also restored, otherwise stronger engineering will be required."
          },
          {
            "desc": "Expand the artificial reef network only.",
            "target": "c",
            "outcome": "Year +4 → +6\n\nMore reef modules create additional habitat and attract fish, but they do not stop storm surges or restore sand movement. By Year 10 the town is vulnerable unless major engineering is added. Ecosystems also decline and costs rise."
          }
        ]
      },
      "ba": {
        "image": "eroded_beach.png",
        "text": "Storm clusters accelerate erosion and expose homes along the most at-risk fringe.",
        "options": [
          {
            "desc": "Choose nature-first and move the most exposed fringe (managed retreat).",
            "target": "a",
            "outcome": "Year +4 → +6\n\nRelocating the highest-risk homes creates space for mangroves, dunes, and seagrass to grow. The town core remains safe by Year 10, and ecosystems improve."
          },
          {
            "desc": "Use living shorelines plus targeted sand to hold the town core.",
            "target": "b",
            "outcome": "Year +4 → +6\n\nMangroves and dunes are strengthened and sand is placed where it helps most. With steady funding and some hard structures, the town core stays safe by Year 10 and ecosystems recover to a moderate level."
          },
          {
            "desc": "Invest in habitat recovery only and avoid interim protection.",
            "target": "c",
            "outcome": "Year +4 → +6\n\nNatural buffers grow slowly and homes remain exposed in the meantime. Without engineering or managed retreat, severe events could force larger relocations later."
          }
        ]
      },
      "bb": {
        "image": "wall_strong.png",
        "text": "The seawall reassures residents but changes sand movement and harms habitats nearby.",
        "options": [
          {
            "desc": "Install sand bypass systems to move sand around the wall.",
            "target": "a",
            "outcome": "Year +4 → +6\n\nBypass pumps restore some sand flow. The town remains safe by Year 10, but costs stay high and ecosystems are only partly stable."
          },
          {
            "desc": "Schedule regular sand nourishment around the seawall.",
            "target": "b",
            "outcome": "Year +4 → +6\n\nNew sand keeps beaches wider for a time. The town is safe by Year 10, but budgets are stretched and ecosystems remain under pressure from constant works."
          },
          {
            "desc": "Focus on the wall’s integrity and accept ecosystem losses.",
            "target": "c",
            "outcome": "Year +4 → +6\n\nThe town is likely held in place by Year 10, but turtle nesting and seagrass meadows are mostly lost, and the wall can still be overtopped in the strongest storms."
          }
        ]
      },
      "ca": {
        "image": "eco_tour.png",
        "text": "Tourism grows. The town must balance income with protecting fragile habitats.",
        "options": [
          {
            "desc": "Keep strict eco-guidelines and add shoreline buffers later.",
            "target": "a",
            "outcome": "Year +4 → +6\n\nRules limit damage and help recovery. With mangroves, dunes, or selective hardening added later, the town remains safe by Year 10 and ecosystems hold at a moderate level."
          },
          {
            "desc": "Push for more visitors quickly to maximise income.",
            "target": "b",
            "outcome": "Year +4 → +6\n\nHeavy tourism stresses habitats and weakens resilience. The town can still be held by Year 10 with engineering, but ecosystems decline and costs rise."
          },
          {
            "desc": "Let nature recover on its own without new rules.",
            "target": "c",
            "outcome": "Year +4 → +6\n\nRecovery is uneven and some areas remain exposed. To keep the town safe by Year 10, heavier engineering will be needed, with larger ecological trade-offs."
          }
        ]
      },
      "cb": {
        "image": "beach.png",
        "text": "Beach nourishment boosts width but needs repeating after storms.",
        "options": [
          {
            "desc": "Shift toward nature-based defences and reinforce key gaps.",
            "target": "a",
            "outcome": "Year +4 → +6\n\nSeagrass, mangroves, and dunes improve long-term stability, and light structures fill weak points. The town stays safe by Year 10 with better ecosystem outcomes and more predictable costs."
          },
          {
            "desc": "Continue frequent nourishment cycles.",
            "target": "b",
            "outcome": "Year +4 → +6\n\nThe town remains safe by Year 10 if funding continues, but costs escalate and ecosystems are stressed by repeated sand placement."
          },
          {
            "desc": "Switch to a seawall to lock in protection.",
            "target": "c",
            "outcome": "Year +4 → +6\n\nA wall improves urban safety. The town remains in place by Year 10, but flanking erosion and habitat loss increase unless sand is actively moved. Very strong storms can still overtop sections."
          }
        ]
      }
    },
    "3": {
      "aaa": {
        "image": "citizen_science.png",
        "text": "Seagrass, mangroves, and dunes are strengthening, but choices remain on how to maintain them.",
        "options": [
          {
            "desc": "Encourage citizen science and community care (seagrass watch, turtle patrols, dune planting).",
            "target": "a",
            "outcome": "Year +6 → +8\n\nMonitoring and planting efforts keep costs low and habitats thriving. Seagrass improves water clarity, mangroves reduce storm surges, and dunes trap sand. By Year 10 the town avoids relocation, with natural systems providing 18–22 more years of coastal protection at low cost."
          },
          {
            "desc": "Rely on professional teams for monitoring and restoration.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nExpert-led projects maintain steady recovery, though costs rise over time. Ecosystems remain strong, and by Year 10 the town avoids relocation. This pathway adds 15–20 more years of resilience with higher maintenance spending."
          }
        ]
      },
      "aab": {
        "image": "seagrass.png",
        "text": "Ecosystem recovery has begun. The town can either focus resources on key hotspots or attempt a large expansion.",
        "options": [
          {
            "desc": "Use targeted restoration in key sites (transplanting seagrass patches or reinforcing dunes in hotspots).",
            "target": "a",
            "outcome": "Year +6 → +8\n\nFocused projects succeed in the most vulnerable areas. Some seagrass transplants establish while others fail, and not all dune fencing holds during storms. By Year 10 the town is safe, and this adds 12–16 years of resilience with lower costs and more predictable results."
          },
          {
            "desc": "Expand restoration zones widely (mangrove forests, dune grass corridors, seagrass meadows).",
            "target": "b",
            "outcome": "Year +6 → +8\n\nLarge-scale planting begins, including drone-based mangrove planting and wide seagrass meadow trials. However, high costs drain funds and survival rates are patchy — storms uproot seedlings and some seagrass beds die back. By Year 10 the town remains safe, but projects are scaled back after Year 8, leaving uneven recovery. This may add 10–14 years of stability, but at heavy financial cost."
          }
        ]
      },
      "aac": {
        "image": "decline.png",
        "text": "Boating pressure is rising again, threatening fragile seagrass recovery.",
        "options": [
          {
            "desc": "Reinstate strict boating limits (no-anchor zones, seagrass protection areas, speed controls).",
            "target": "a",
            "outcome": "Year +6 → +8\n\nLimits reduce propeller and anchor scarring, and water clarity improves. By Year 10 the town is safe, with 12–15 years of resilience from healthier seagrass beds."
          },
          {
            "desc": "Do nothing and hope natural recovery continues.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nSeagrass is damaged by repeated anchoring and propeller scars. Water becomes murkier, weakening reef and dune systems. By Year 10 the town requires extra engineering, with only 8–12 years of resilience."
          }
        ]
      },
      "aba": {
        "image": "balance.png",
        "text": "The artificial reef and ecosystem restoration are working together, but the council warns that reefs alone cannot hold back future storms. Funding pressures are rising, and choices must be made.",
        "options": [
          {
            "desc": "Allow a partial retreat: relocate exposed areas and focus protection on the town core.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nRelocating the most at-risk homes frees resources to strengthen reefs, seagrass, mangroves, and dunes near the town core. By Year 10 the core town is well protected, ecosystems are healthier, and this pathway could add 15–20 years of resilience at sustainable cost."
          },
          {
            "desc": "Continue all restoration projects despite their high cost.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nReefs, seagrass, mangroves, and dunes are all maintained, but costs spiral and survival rates are uneven. By Year 10 the town is still safe, yet funding is nearly exhausted, leaving only 2–4 years of resilience beyond Year 10 before cutbacks or engineering become unavoidable."
          }
        ]
      },
      "abb": {
        "image": "marine_zone.png",
        "text": "The protected reef and seagrass beds are showing recovery, but some residents push back against rules and costs. The town must decide whether to keep protections in place or relax them.",
        "options": [
          {
            "desc": "Maintain reef and seagrass protections despite conflict.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nProtections hold firm, keeping seagrass healthy and fish populations stable. While rules remain unpopular with some, ecosystems strengthen and help buffer storm impacts. By Year 10 the town is safe, ecosystems are moderately healthy, and this pathway adds 12–16 years of resilience beyond Year 10."
          },
          {
            "desc": "Relax protections to reduce conflict and enforcement costs.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nWith fewer restrictions, seagrass beds and reef recovery slow, reducing natural storm protection. By Year 10 the town can remain safe only by relocating the most vulnerable homes near the shoreline. The town core holds, but ecosystems are weaker. This pathway adds 8–12 years of resilience at reduced cost."
          }
        ]
      },
      "abc": {
        "image": "art_reef.png",
        "text": "Budgets are tight, and decisions about how to fund coastal protection have been delayed. The town must now decide how to respond as erosion worsens.",
        "options": [
          {
            "desc": "Shift resources to protecting seagrass as a natural buffer.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nSeagrass protection begins, improving water clarity and reducing wave energy, but the decision came too late for some areas. By Year 10 the town can remain safe only by relocating the most vulnerable homes in a partial retreat. Ecosystems recover moderately, and resilience extends 8–12 years beyond Year 10."
          },
          {
            "desc": "Provide no additional protection and leave systems as they are.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nWithout new measures, erosion accelerates and rising seas overtake defences. By Year 10 the town is still in place, but a full-scale retreat inland will be needed soon after. Ecosystems decline, and resilience lasts only 2–4 years beyond Year 10."
          }
        ]
      },
      "baa": {
        "image": "relocation.png",
        "text": "Exposure is still highest along the outer fringe of the coast.",
        "options": [
          {
            "desc": "Relocate the outer fringe and expand natural buffers to protect the town core.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nMoving the most exposed homes creates space for mangroves and dunes to grow. By Year 10 the town core stays safe, and this approach could add 20–25 years beyond Year 10 with lower emergency costs."
          },
          {
            "desc": "Slow the relocation to reduce conflict and focus on holding the line.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nHomes remain in harm’s way for longer. The town can still stay safe by Year 10 with added hard structures and sand, but ecosystems decline and costs are higher. This may add 10–15 years beyond Year 10."
          }
        ]
      },
      "bab": {
        "image": "relocation.png",
        "text": "A hybrid plan is underway, using living shorelines and targeted sand placements.",
        "options": [
          {
            "desc": "Invest to scale the hybrid and add small hard structures where needed.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nCoverage expands and waves are softened across more of the coast. By Year 10 the town stays safe, and this could add 15–20 years beyond Year 10 with ongoing maintenance."
          },
          {
            "desc": "Keep the plan small and rely on periodic nourishment.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nThe benefits remain local. The town can be held by Year 10 with extra engineering, but ecosystems are more stressed. This may add 10–12 years beyond Year 10."
          }
        ]
      },
      "bac": {
        "image": "habitat_restore.png",
        "text": "A nature-only approach faces repeated tests during strong storm seasons.",
        "options": [
          {
            "desc": "Double down on restoration and move the most exposed properties.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nEcosystems keep improving and emergency losses fall. By Year 10 the town core stays safe, and this could add 18–22 years beyond Year 10 if planting continues."
          },
          {
            "desc": "Add minimal emergency barriers to hold the line during storms.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nSelective structures reduce flood peaks. By Year 10 the town largely remains safe, and this may add 12–16 years beyond Year 10 with regular upkeep."
          }
        ]
      },
      "bba": {
        "image": "sand_bypass.png",
        "text": "Sand bypass systems are moving sand along the coast, but they need energy and maintenance.",
        "options": [
          {
            "desc": "Expand and modernise the bypass and support key habitat areas.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nSand delivery improves and important beaches stabilise. By Year 10 the town remains safe, and this could add 12–18 years beyond Year 10, though costs stay high."
          },
          {
            "desc": "Limit the bypass to the most critical sites.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nKey beaches hold while others still erode. The town can remain safe by Year 10 with added hardening, and this may add 10–15 years beyond Year 10 with mixed ecosystem results."
          }
        ]
      },
      "bbb": {
        "image": "sand_transport.png",
        "text": "Regular sand placement offsets losses near the wall, but it must be repeated after storms.",
        "options": [
          {
            "desc": "Increase the amount and timing of sand placement.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nBeaches stay wider and tourism holds up. By Year 10 the town remains safe, but ecosystems are stressed and costs keep rising. This may add 10–12 years beyond Year 10 if funding continues."
          },
          {
            "desc": "Shift budget into living shorelines and use smaller, smarter placements.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nDisturbance is lower and habitats gain ground. By Year 10 the town stays safe, and this could add 12–16 years beyond Year 10 with steady care."
          }
        ]
      },
      "bbc": {
        "image": "storm_wall.png",
        "text": "Ecosystems have declined and seawall overtopping during severe storms is more frequent.",
        "options": [
          {
            "desc": "Raise and reinforce the wall and protect the base and ends.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nUrban safety improves and most waves are blocked. By Year 10 the town stays, but strong storms can still test the wall and ecosystems are heavily degraded. This may add 10–15 years beyond Year 10."
          },
          {
            "desc": "Begin a planned inland growth area and relocate over time.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nA structured retreat reduces long-term risk and allows shoreline habitats to recover. This choice is disruptive now but offers resilience for many decades beyond Year 10."
          }
        ]
      },
      "caa": {
        "image": "marine_zone.png",
        "text": "Guidelines limit damage to recovering sites, but enforcement requires effort and funding.",
        "options": [
          {
            "desc": "Keep strict rules and reinforce a few weak shoreline points.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nSites cope better with heatwaves and visitor pressure. By Year 10 the town remains safe, and this could add 15–20 years beyond Year 10 with consistent enforcement."
          },
          {
            "desc": "Relax rules to attract more visitors quickly.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nWear and tear increases and natural buffers weaken. The town can still be protected by Year 10 with heavier engineering, but ecosystems decline. This may add only 8–12 years beyond Year 10."
          }
        ]
      },
      "cab": {
        "image": "beach.png",
        "text": "Over-tourism has begun to stress recovering habitats, and the town must respond.",
        "options": [
          {
            "desc": "Re-introduce visitor limits and protect the most sensitive areas.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nDecline slows and resilience returns. With a few reinforcements, the town remains safe by Year 10 and this can add 12–16 years beyond Year 10."
          },
          {
            "desc": "Keep expanding visitor numbers and hope for the best.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nImpacts build up and the coast becomes more fragile. The town can stay by Year 10 only with heavy engineering and high costs, adding about 8–10 years beyond Year 10."
          }
        ]
      },
      "cac": {
        "image": "eroded_beach.png",
        "text": "With little management, some sites improve while others decline.",
        "options": [
          {
            "desc": "Add protections for stronger sites and reinforce the most vulnerable gaps.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nHealthier areas hold while weaker spots get support. By Year 10 the town remains safe with added engineering, and this may add 10–15 years beyond Year 10."
          },
          {
            "desc": "Continue the hands-off approach.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nExposure grows and damage spreads. To keep the town by Year 10, heavy armouring and frequent nourishment are required, giving only about 8–12 more years beyond Year 10."
          }
        ]
      },
      "cba": {
        "image": "seagrass.png",
        "text": "The town is moving funding from sand placement to habitat recovery.",
        "options": [
          {
            "desc": "Stay the course on nature-based measures and reinforce weak points.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nHabitats strengthen and targeted structures close the gaps. By Year 10 the town remains safe, and this could add 15–20 years beyond Year 10."
          },
          {
            "desc": "Return to frequent sand nourishment for fast results.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nBeaches widen again for a while, but dependency returns. The town can remain by Year 10; however, this may add only 8–12 years beyond Year 10 and ecosystems stay stressed."
          }
        ]
      },
      "cbb": {
        "image": "sand_only.png",
        "text": "Relying only on sand nourishment is stretching budgets and stressing habitats.",
        "options": [
          {
            "desc": "Shift to a hybrid plan with living shorelines and selective nourishment.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nErosion slows more effectively and costs are easier to plan. By Year 10 the town stays safe, and this can add 12–16 years beyond Year 10."
          },
          {
            "desc": "Keep using sand nourishment only.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nThe town can remain by Year 10 if funding holds, but sustainability is weak and ecosystems remain stressed. This route may add only 8–10 years beyond Year 10."
          }
        ]
      },
      "cbc": {
        "image": "storm_wall.png",
        "text": "Seawall overtopping during severe storms is more common, and choices are urgent.",
        "options": [
          {
            "desc": "Raise and armour the wall and improve the ends.",
            "target": "a",
            "outcome": "Year +6 → +8\n\nProtection improves and most waves are held back. By Year 10 the town stays, but the environment is heavily degraded and rare extreme storms can still cause damage. This may add 10–15 years beyond Year 10."
          },
          {
            "desc": "Start a structured managed retreat to a safer inland area.",
            "target": "b",
            "outcome": "Year +6 → +8\n\nRelocating over time lowers long-term risk and lets shore habitats recover. This choice is disruptive now but can provide stable resilience for many decades beyond Year 10."
          }
        ]
      }
    }
  }
}
